#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/moonandbeyond/moonandbeyond-website-gh-workflow/runs/run-4qoxkPBKEi6zcDNV

Waiting for the plan to start...

Terraform v1.0.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.homepage.aws_s3_bucket.website will be created
  + resource "aws_s3_bucket" "website" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "moon-and-beyond-money-machine-gh-actions-production"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "env" = "production"
        }
      + tags_all                    = {
          + "env" = "production"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "error.html"
          + index_document = "index.html"
        }
    }

  # module.homepage.aws_s3_bucket_object.object["error.html"] will be created
  + resource "aws_s3_bucket_object" "object" {
      + acl                    = "public-read"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content                = <<-EOT
            <!doctype html>
            <html class="no-js" lang="">
            
            <head>
              <meta charset="utf-8">
              <title>Moon and Beyond</title>
              <meta name="description" content="">
              <meta name="viewport" content="width=device-width, initial-scale=1">
            
              <meta property="og:title" content="">
              <meta property="og:type" content="">
              <meta property="og:url" content="">
              <meta property="og:image" content="">
            
              <link rel="manifest" href="site.webmanifest">
              <link rel="apple-touch-icon" href="icon.png">
              <!-- Place favicon.ico in the root directory -->
            
              <link rel="stylesheet" href="css/normalize.css">
              <link rel="stylesheet" href="css/style.css">
            
              <meta name="theme-color" content="#fafafa">
            </head>
            
            <body>
            
              <!-- Add your site or application content here -->
              <img src="https://i.imgur.com/sohWhy9.jpg" />
              <p>Error on <strong>production</strong></p>
            
            </body>
            
            </html>
        EOT
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "error.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.homepage.aws_s3_bucket_object.object["index.html"] will be created
  + resource "aws_s3_bucket_object" "object" {
      + acl                    = "public-read"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content                = <<-EOT
            <!doctype html>
            <html class="no-js" lang="">
            
            <head>
              <meta charset="utf-8">
              <title>Moon and Beyond</title>
              <meta name="description" content="">
              <meta name="viewport" content="width=device-width, initial-scale=1">
            
              <meta property="og:title" content="">
              <meta property="og:type" content="">
              <meta property="og:url" content="">
              <meta property="og:image" content="">
            
              <link rel="manifest" href="site.webmanifest">
              <link rel="apple-touch-icon" href="icon.png">
              <!-- Place favicon.ico in the root directory -->
            
              <link rel="stylesheet" href="css/normalize.css">
              <link rel="stylesheet" href="css/style.css">
            
              <meta name="theme-color" content="#fafafa">
            </head>
            
            <body>
            
              <!-- Add your site or application content here -->
              <img src="https://s2.coinmarketcap.com/static/img/coins/200x200/5426.png" >
              <p>Make money, buy crypto</p>
              <p>Running on <strong>production</strong></p>
            
            </body>
            
            </html>
        EOT
      + content_type           = "text/html"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
╷
│ Warning: Version constraints inside provider configuration blocks are deprecated
│ 
│   on main.tf line 2, in provider "aws":
│    2:   version    = "~> 3.0"
│ 
│ Terraform 0.13 and earlier allowed provider version constraints inside the
│ provider configuration block, but that is now deprecated and will be
│ removed in a future version of Terraform. To silence this warning, move the
│ provider version constraint into the required_providers block.
╵

```

</details>

*Pusher: @mralanlee, Action: `pull_request`*